===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
s1    sn1    i2    mod(s1, i2)    
null     4     2     null     
4     2     null     null     
4     2a     2     0.0     
4     4     2     0.0     
4a     2     2     null     

===================================================
s1    sn1    i2    mod(i2, sn1)    
null     4     2     2.0     
4     2     null     null     
4     2a     2     null     
4     4     2     2.0     
4a     2     2     0.0     

===================================================
s1    sn1    i2    mod(s1, sn1)    
null     4     2     null     
4     2     null     0.0     
4     2a     2     null     
4     4     2     0.0     
4a     2     2     null     

===================================================
0
===================================================
mod('2001-10-11', 4)    
null     

===================================================
mod(4, 'abc')    
null     

===================================================
mod(4, null)    
null     

===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
null     

===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
null     

===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
null     

===================================================
0
===================================================
0
