===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
s1    s2    mod(s1, s2)    
2001-10-11     2              null     
4     2              0.0     

===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
0
===================================================
s1    s2    mod(s1,  ?:0 )    
2001-10-11     2              null     
4     0              null     
4     2              null     

===================================================
0
===================================================
s1    s2    mod( ?:0 , s2)    
2001-10-11     2              0.0     
4     0              2.0     
4     2              0.0     

===================================================
0
===================================================
s1    s2    mod( ?:0 , s2)    
2001-10-11     2              null     
4     0              null     
4     2              null     

===================================================
0
===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
null     

===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
null     

===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
null     

===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
null     

===================================================
0
===================================================
0
