===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
xoo    
dba.xoo     

===================================================
id    
1     

===================================================
1
===================================================
id    
100     

===================================================
testoid1(xoo)    
dba.xoo     

===================================================
1
===================================================
id    
1000     

===================================================
id    
1000     

===================================================
    
dba.xoo     

===================================================
testoid1(xoo)    
dba.xoo     

===================================================
1
===================================================
testoid1(xoo)    
dba.xoo     

===================================================
xoo.id    
1000     

===================================================
    
dba.xoo | true |  || 1000 || 10     

===================================================
testoid2(xoo)    

===================================================
count(*)    
0     

===================================================
0
===================================================
1
===================================================
t.id    
100     
200     

===================================================
1
===================================================
testoid3(set1)    
dba.xoo,dba.xoo,     
dba.xoo,dba.xoo,     

===================================================
t.id    
100     
100     
200     
200     

===================================================
set1    
dba.xoo,dba.xoo,     
dba.xoo,dba.xoo,     

===================================================
Error:-181
===================================================
2
===================================================
1
===================================================
1
===================================================
set1    
dba.xoo,dba.xoo,     

===================================================
xoo    
dba.xoo     

===================================================
Error:-889
===================================================
xxx    
dba.xoo,dba.xoo,     

===================================================
t.id    
100     
200     

===================================================
    
dba.xoo     

===================================================
id    
100     

===================================================
id    
100     

===================================================
testoid3(set1)    
dba.xoo,dba.xoo,     

===================================================
Error:-181
===================================================
Error:-181
===================================================
id    
100     
200     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
xxoo    
dba.xxoo     

===================================================
    
null     

===================================================
:xoid    
dba.yyoo     

===================================================
id    
100000     

===================================================
id    

===================================================
xxoo    
dba.xxoo     

===================================================
    
null     

===================================================
:xoid    
dba.xxoo     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
0
