===================================================
0
===================================================
second('12:23:15')    
15     

===================================================
second( str_to_date('2010-01-02 12:23:25', '%Y-%m-%d %H:%i:%s'))    
25     

===================================================
second('2010-01-01 12:20:43')    
43     

===================================================
0
===================================================
2
===================================================
char_col    second(char_col)    
2010-01-02 10:19:21                  21     
2010-01-02                           null     

===================================================
varchar_col    second(varchar_col)    
asdf     null     
1971-12-22 00:14:11     11     

===================================================
string_col    second(string_col)    
05/04/2010 12:23:15.123     15     
10/04/2010 12:23:15.123     15     

===================================================
bit_col    second(bit_col)    
null     null     
null     null     

===================================================
integer_col    second(integer_col)    
12000     0     
12000     0     

===================================================
smallint_col    second(smallint_col)    
10     10     
11     11     

===================================================
bigint_col    second(bigint_col)    
1111111111     11     
1111111111     11     

===================================================
float_col    second(float_col)    
12.25     12     
12.25     12     

===================================================
double_col    second(double_col)    
111.11111111     11     
111.11111111     11     

===================================================
numeric_col    second(numeric_col)    
11.12     11     
11.12     11     

===================================================
monetary_col    second(monetary_col)    
1234.0     null     
1234.0     null     

===================================================
date_col    second(date_col)    
2010-01-02 00:00:00.0     0     
2010-01-02 00:00:00.0     0     

===================================================
time_col    second(time_col)    
12:10:09     9     
12:10:09     9     

===================================================
timestamp_col    second(timestamp_col)    
2008-10-11 10:49:51.0     51     
2008-10-11 10:49:51.0     51     

===================================================
datetime_col    second(datetime_col)    
1983-01-02 17:28:31.0     31     
1983-01-02 17:28:31.0     31     

===================================================
Error:-494
===================================================
char_col    varchar_col    string_col    bit_col    integer_col    smallint_col    bigint_col    float_col    double_col    numeric_col    monetary_col    date_col    time_col    timestamp_col    datetime_col    set_col    

===================================================
char_col    varchar_col    string_col    bit_col    integer_col    smallint_col    bigint_col    float_col    double_col    numeric_col    monetary_col    date_col    time_col    timestamp_col    datetime_col    set_col    
2010-01-02 10:19:21                  asdf     05/04/2010 12:23:15.123     null     12000     10     1111111111     12.25     111.11111111     11.12     1234.0     2010-01-02 00:00:00.0     12:10:09     2008-10-11 10:49:51.0     1983-01-02 17:28:31.0     null     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
attr_name    class_name    attr_type    def_order    from_class_name    from_attr_name    data_type    prec    scale    charset    collation    domain_class_name    default_value    is_nullable    comment    
 second('2010-01-02 11:12:13')     second_tests     INSTANCE     0     null     null     INTEGER     10     0     Not applicable     Not applicable     null     null     YES     null     

===================================================
second('2010-01-02 11:12:13')    
13     

===================================================
0
===================================================
0
===================================================
v    
10     

===================================================
0
===================================================
rez    
32     

===================================================
rez    
32     

===================================================
rez    
null     

===================================================
rez    
15     

===================================================
second(datetime '2003-12-31 01:02:03.1234')    if( second(datetime '2003-12-31 01:02:03.1234')=3, 'ok', 'nok')    
3     ok     

===================================================
second(timestamp '2003-12-31 01:02:03')    if( second(timestamp '2003-12-31 01:02:03')=3, 'ok', 'nok')    
3     ok     

===================================================
second(time '01:02:03')    if( second(time '01:02:03')=3, 'ok', 'nok')    
3     ok     

===================================================
second('2003-12-31 01:02:03.1234')    if( second('2003-12-31 01:02:03.1234')=3, 'ok', 'nok')    
3     ok     

===================================================
second('2003-12-31 01:02:03')    if( second('2003-12-31 01:02:03')=3, 'ok', 'nok')    
3     ok     

===================================================
second('01:02:03')    if( second('01:02:03')=3, 'ok', 'nok')    
3     ok     

===================================================
if( second( CURRENT_DATE ) is null , 'ok', 'not ok')    
ok     

===================================================
if( second( CURRENT_DATETIME )= cast( date_format( CURRENT_DATETIME , '%s') as integer), 'ok', 'not ok')    
ok     

===================================================
if( second( CURRENT_TIMESTAMP )= cast( date_format( CURRENT_TIMESTAMP , '%s') as integer), 'ok', 'not ok')    
ok     

===================================================
if( second( CURRENT_TIME )= cast( date_format( CURRENT_TIMESTAMP , '%s') as integer), 'ok', 'not ok')    
ok     

===================================================
second('23:59:59')    if( second('23:59:59')=59, 'ok', 'nok')    
59     ok     

===================================================
second('00:00:00')    if( second('00:00:00')=0, 'ok', 'nok')    
0     ok     

===================================================
second(time '00:00:00'-1)    if( second(time '00:00:00'-1)=59, 'ok', 'nok')    
59     ok     

===================================================
second(time '23:59:59'+1)    if( second(time '23:59:59'+1)=0, 'ok', 'nok')    
0     ok     

===================================================
second('00:00:60')    
null     

===================================================
second('00:00:-10')    
0     

===================================================
second('2003-12-31')    
null     

===================================================
0
===================================================
second('12:23:15')    
15     

===================================================
second( str_to_date('2010-01-02 12:23:25', '%Y-%m-%d %H:%i:%s'))    
25     

===================================================
second('2010-01-01 12:20:43')    
43     

===================================================
0
===================================================
2
===================================================
Error:-787
===================================================
Error:-787
===================================================
string_col    second(string_col)    
05/04/2010 12:23:15.123     15     
10/04/2010 12:23:15.123     15     

===================================================
bit_col    second(bit_col)    
null     null     
null     null     

===================================================
integer_col    second(integer_col)    
12000     0     
12000     0     

===================================================
smallint_col    second(smallint_col)    
10     10     
11     11     

===================================================
bigint_col    second(bigint_col)    
1111111111     11     
1111111111     11     

===================================================
float_col    second(float_col)    
12.25     12     
12.25     12     

===================================================
double_col    second(double_col)    
111.11111111     11     
111.11111111     11     

===================================================
numeric_col    second(numeric_col)    
11.12     11     
11.12     11     

===================================================
Error:-787
===================================================
date_col    second(date_col)    
2010-01-02 00:00:00.0     0     
2010-01-02 00:00:00.0     0     

===================================================
time_col    second(time_col)    
12:10:09     9     
12:10:09     9     

===================================================
timestamp_col    second(timestamp_col)    
2008-10-11 10:49:51.0     51     
2008-10-11 10:49:51.0     51     

===================================================
datetime_col    second(datetime_col)    
1983-01-02 17:28:31.0     31     
1983-01-02 17:28:31.0     31     

===================================================
Error:-494
===================================================
Error:-787
===================================================
char_col    varchar_col    string_col    bit_col    integer_col    smallint_col    bigint_col    float_col    double_col    numeric_col    monetary_col    date_col    time_col    timestamp_col    datetime_col    set_col    
2010-01-02 10:19:21                  asdf     05/04/2010 12:23:15.123     null     12000     10     1111111111     12.25     111.11111111     11.12     1234.0     2010-01-02 00:00:00.0     12:10:09     2008-10-11 10:49:51.0     1983-01-02 17:28:31.0     null     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
attr_name    class_name    attr_type    def_order    from_class_name    from_attr_name    data_type    prec    scale    charset    collation    domain_class_name    default_value    is_nullable    comment    
 second('2010-01-02 11:12:13')     second_tests     INSTANCE     0     null     null     INTEGER     10     0     Not applicable     Not applicable     null     null     YES     null     

===================================================
second('2010-01-02 11:12:13')    
13     

===================================================
0
===================================================
0
===================================================
v    
10     

===================================================
0
===================================================
rez    
32     

===================================================
rez    
32     

===================================================
Error:-787
===================================================
rez    
15     

===================================================
second(datetime '2003-12-31 01:02:03.1234')    if( second(datetime '2003-12-31 01:02:03.1234')=3, 'ok', 'nok')    
3     ok     

===================================================
second(timestamp '2003-12-31 01:02:03')    if( second(timestamp '2003-12-31 01:02:03')=3, 'ok', 'nok')    
3     ok     

===================================================
second(time '01:02:03')    if( second(time '01:02:03')=3, 'ok', 'nok')    
3     ok     

===================================================
second('2003-12-31 01:02:03.1234')    if( second('2003-12-31 01:02:03.1234')=3, 'ok', 'nok')    
3     ok     

===================================================
second('2003-12-31 01:02:03')    if( second('2003-12-31 01:02:03')=3, 'ok', 'nok')    
3     ok     

===================================================
second('01:02:03')    if( second('01:02:03')=3, 'ok', 'nok')    
3     ok     

===================================================
Error:-787
===================================================
if( second( CURRENT_DATETIME )= cast( date_format( CURRENT_DATETIME , '%s') as integer), 'ok', 'not ok')    
ok     

===================================================
if( second( CURRENT_TIMESTAMP )= cast( date_format( CURRENT_TIMESTAMP , '%s') as integer), 'ok', 'not ok')    
ok     

===================================================
if( second( CURRENT_TIME )= cast( date_format( CURRENT_TIMESTAMP , '%s') as integer), 'ok', 'not ok')    
ok     

===================================================
second('23:59:59')    if( second('23:59:59')=59, 'ok', 'nok')    
59     ok     

===================================================
second('00:00:00')    if( second('00:00:00')=0, 'ok', 'nok')    
0     ok     

===================================================
second(time '00:00:00'-1)    if( second(time '00:00:00'-1)=59, 'ok', 'nok')    
59     ok     

===================================================
second(time '23:59:59'+1)    if( second(time '23:59:59'+1)=0, 'ok', 'nok')    
0     ok     

===================================================
Error:-494
===================================================
second('00:00:-10')    
0     

===================================================
Error:-494
===================================================
0
