===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
s    b    d    s1    s2    s3    i1    
null     aa     2000-10-10     1234     abcd     1234     -2     
1234     null     2000-10-10     1234     null     abcd     0     
1234     aa     null     null     abcd     1234     -21     
1234     aa     2000-10-10     null     null     null     21     
1234     aa     2000-10-10     1234     abcd     null     null     
1234     aa     2000-10-10     1234     abcd     abcd     1     

===================================================
field('abcd', s2, '1234')    
1     
0     
1     
0     
1     
1     

===================================================
field('1234', s1, s2)    
1     
1     
0     
0     
1     
1     

===================================================
field(s1, s2, s3)    
2     
0     
0     
0     
0     
0     

===================================================
Error:-494
===================================================
field('x', s1, s2)    
0     
0     
0     
0     
0     
0     

===================================================
field('x', '1')    
0     

===================================================
Error:-494
===================================================
field('x', null, null)    
0     

===================================================
0
===================================================
field( ?:0 ,  ?:1 ,  ?:2 )    
2     

===================================================
0
===================================================
field( ?:0 ,  ?:1 ,  ?:2 )    
0     

===================================================
0
===================================================
field( ?:0 ,  ?:1 ,  ?:2 )    
2     

===================================================
Error:-494
===================================================
field('11', '22', '22', '11')    
3     

===================================================
0
===================================================
0
