===================================================
0
===================================================
0
===================================================
0
===================================================
name    groups    
TEST_USER1     DBA     
TEST_USER1     PUBLIC     
TEST_USER2     PUBLIC     

===================================================
    
null     

===================================================
Error:-142
===================================================
0
===================================================
name    groups    
TEST_USER1     DBA     
TEST_USER1     PUBLIC     
TEST_USER2     PUBLIC     
TEST_USER2     TEST_USER1     

===================================================
    
null     

===================================================
Error:-142
===================================================
0
===================================================
name    groups    
TEST_USER1     DBA     
TEST_USER2     TEST_USER1     

===================================================
    
null     

===================================================
0
===================================================
name    groups    
TEST_USER1     DBA     
TEST_USER1     PUBLIC     
TEST_USER2     PUBLIC     
TEST_USER2     TEST_USER1     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
