===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
( lpad('CUBRID', a, 'X'))    
null     
XXXXCUBRID     

===================================================
( lpad(a, 10, 'X'))    
XXXXXX-100     
XXXXXXXX10     

===================================================
( lpad('CUBRID', 20, a))    
-100-100-100-1CUBRID     
10101010101010CUBRID     

===================================================
0
===================================================
0
===================================================
0
===================================================
Table    Non_unique    Key_name    Seq_in_index    Column_name    Collation    Cardinality    Sub_part    Packed    Null    Index_type    Func    Comment    
t1     1     i1     1     null     A     1     null     null     YES     BTREE      lpad(_iso88591'CUBRID' collate iso88591_bin, [t1].[a], _iso88591'X' collate iso88591_bin)     null     
t1     1     i2     1     null     A     2     null     null     YES     BTREE      lpad( cast([t1].[a] as varchar), 10, _iso88591'X' collate iso88591_bin)     null     
t1     1     i3     1     null     A     2     null     null     YES     BTREE      lpad(_iso88591'CUBRID' collate iso88591_bin, 20,  cast([t1].[a] as varchar))     null     

===================================================
0
