===================================================
{1, 2}-{2, 3}    
1,     

===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
bar    
10,20,     
1,     
2,     
0,1,10,11,12,13,14,     

===================================================
0
===================================================
0
===================================================
1
===================================================
s    
abc     

===================================================
0
===================================================
0
===================================================
1
===================================================
0
===================================================
0
===================================================
1
===================================================
a    
1.2,3.4,     

===================================================
0
===================================================
0
===================================================
1
===================================================
dates    
2056-04-07,     

===================================================
0
===================================================
0
===================================================
1
===================================================
a    sa    
0     0,     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
b    sx    
y0     x,x,     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
b    sx    
y0     x,x,     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
s    s    set((select w.i from w where w.i>y0.a.i))    
y0     y0     10,20,     
y0     y1     10,20,     
y1     y0     10,20,     
y1     y1     10,20,     

===================================================
0
===================================================
0
===================================================
1
===================================================
a    sx    
10     null     
null     x,     

===================================================
0
===================================================
0
