===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
0
===================================================
1
===================================================
class_name    partition_name    partition_class_name    partition_type    partition_expr    partition_values    comment    
range_test     p0     range_test__p__p0     RANGE     [test_datetime]     null,2006-02-01 09:00:00.0,     null     
range_test     p1     range_test__p__p1     RANGE     [test_datetime]     2006-02-01 09:00:00.0,2006-03-01 10:00:00.0,     null     
range_test     p2     range_test__p__p2     RANGE     [test_datetime]     2006-03-01 10:00:00.0,2006-04-01 11:00:00.0,     null     
range_test     p3     range_test__p__p3     RANGE     [test_datetime]     2006-04-01 11:00:00.0,2006-05-01 11:00:00.0,     null     

===================================================
id    test_int    test_char    test_varchar    test_datetime    
1     1     aaa                                                    aaa     2006-01-01 09:00:00.0     
2     2     bbb                                                    bbb     2006-01-02 09:00:00.0     
3     3     ccc                                                    ccc     2006-01-03 09:00:00.0     
4     11     ddd                                                    ddd     2006-02-01 09:00:00.0     
5     12     eee                                                    eee     2006-02-02 09:00:00.0     
6     13     fff                                                    fff     2006-02-03 09:00:00.0     
7     21     ggg                                                    ggg     2006-03-01 09:00:00.0     
8     22     hhh                                                    hhh     2006-03-02 09:00:00.0     
9     23     iii                                                    iii     2006-03-03 09:00:00.0     
11     50     kkk                                                    kkk     2000-05-01 11:00:00.0     

===================================================
id    test_int    test_char    test_varchar    test_datetime    
1     1     aaa                                                    aaa     2006-01-01 09:00:00.0     
2     2     bbb                                                    bbb     2006-01-02 09:00:00.0     
3     3     ccc                                                    ccc     2006-01-03 09:00:00.0     
11     50     kkk                                                    kkk     2000-05-01 11:00:00.0     

===================================================
id    test_int    test_char    test_varchar    test_datetime    
4     11     ddd                                                    ddd     2006-02-01 09:00:00.0     
5     12     eee                                                    eee     2006-02-02 09:00:00.0     
6     13     fff                                                    fff     2006-02-03 09:00:00.0     
7     21     ggg                                                    ggg     2006-03-01 09:00:00.0     

===================================================
id    test_int    test_char    test_varchar    test_datetime    
8     22     hhh                                                    hhh     2006-03-02 09:00:00.0     
9     23     iii                                                    iii     2006-03-03 09:00:00.0     

===================================================
id    test_int    test_char    test_varchar    test_datetime    

===================================================
0
