===================================================
    
05/26/2010     

===================================================
    
11:11:11 AM 05/26/2010     

===================================================
    
11:01:11.123 AM 05/26/2010     

===================================================
    
2010-05-26     

===================================================
    
2010-05-26 11:11:11.0     

===================================================
    
2010-05-26 11:01:11.123     

===================================================
    
01:00:00     

===================================================
    
01:00:00     

===================================================
0
===================================================
timestamp( ?:0 , 0)    
2010-05-26 00:00:00.0     

===================================================
0
===================================================
timestamp(:str_date, 0)    
2010-05-26 00:00:00.0     

===================================================
case1    
YES     

===================================================
0
===================================================
timestamp( ?:0 , 0)    
2010-05-26 11:11:11.0     

===================================================
0
===================================================
timestamp(:str_timestamp, 0)    
2010-05-26 11:11:11.0     

===================================================
case2    
YES     

===================================================
0
===================================================
timestamp( ?:0 , 0)    
2010-05-26 11:01:11.123     

===================================================
0
===================================================
timestamp(:str_datetime, 0)    
2010-05-26 11:01:11.123     

===================================================
case3    
YES     

===================================================
0
===================================================
timestamp( ?:0 , 0)    
2010-05-26 00:00:00.0     

===================================================
0
===================================================
timestamp(:d_date, 0)    
2010-05-26 00:00:00.0     

===================================================
case4    
YES     

===================================================
0
===================================================
timestamp( ?:0 , 0)    
2010-05-26 11:11:11.0     

===================================================
0
===================================================
timestamp(:ts_timestamp, 0)    
2010-05-26 11:11:11.0     

===================================================
case5    
YES     

===================================================
0
===================================================
timestamp( ?:0 , 0)    
2010-05-26 11:01:11.123     

===================================================
0
===================================================
timestamp(:dt_datetime, 0)    
2010-05-26 11:01:11.123     

===================================================
case6    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 01:00:00.0     

===================================================
0
===================================================
timestamp(:str_date, :str_interval)    
2010-05-26 01:00:00.0     

===================================================
case7    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 12:11:11.0     

===================================================
0
===================================================
timestamp(:str_timestamp, :str_interval)    
2010-05-26 12:11:11.0     

===================================================
case8    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 12:01:11.123     

===================================================
0
===================================================
timestamp(:str_datetime, :str_interval)    
2010-05-26 12:01:11.123     

===================================================
case9    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 01:00:00.0     

===================================================
0
===================================================
timestamp(:d_date, :str_interval)    
2010-05-26 01:00:00.0     

===================================================
case10    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 12:11:11.0     

===================================================
0
===================================================
timestamp(:ts_timestamp, :str_interval)    
2010-05-26 12:11:11.0     

===================================================
case11    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 12:01:11.123     

===================================================
0
===================================================
timestamp(:dt_datetime, :str_interval)    
2010-05-26 12:01:11.123     

===================================================
case12    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 01:00:00.0     

===================================================
0
===================================================
timestamp(:str_date, :time_interval)    
2010-05-26 01:00:00.0     

===================================================
case13    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 12:11:11.0     

===================================================
0
===================================================
timestamp(:str_timestamp, :time_interval)    
2010-05-26 12:11:11.0     

===================================================
case14    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 12:01:11.123     

===================================================
0
===================================================
timestamp(:str_datetime, :time_interval)    
2010-05-26 12:01:11.123     

===================================================
case15    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 01:00:00.0     

===================================================
0
===================================================
timestamp(:d_date, :time_interval)    
2010-05-26 01:00:00.0     

===================================================
case16    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 12:11:11.0     

===================================================
0
===================================================
timestamp(:ts_timestamp, :time_interval)    
2010-05-26 12:11:11.0     

===================================================
case17    
YES     

===================================================
0
===================================================
timestamp( ?:0 ,  ?:1 )    
2010-05-26 12:01:11.123     

===================================================
0
===================================================
timestamp(:dt_datetime, :time_interval)    
2010-05-26 12:01:11.123     

===================================================
case18    
YES     

