
create user u_______10u_______20u_______30z;

-- maximun length: 117 + 4(_ai_)  + 101 = 222
create table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______1101234567
       (
         c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100c int auto_increment
       );
select name from _db_serial;

rename table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______1101234567 
          as t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t;
select name from _db_serial;

alter table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t
      change column c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100c
	            c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100cxyz int;
select name from _db_serial;

alter table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t
      change column c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100cxyz
	            c_______10c_______20c_______30 int;
alter table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t
      change column c_______10c_______20c_______30
	            c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100cxyz int;
select name from _db_serial;

alter table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t 
       owner to 	u_______10u_______20u_______30z;
select unique_name from _db_serial;

drop table u_______10u_______20u_______30z.t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t;


-- exceed limit: 118 + 4(_ai_)  + 101 = 223
create table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______11012345678
       (
         c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100c int auto_increment
       );
select name from _db_serial;

rename table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______11012345678 
          as t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t;
select name from _db_serial;

alter table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t
      change column c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100c
                    c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100cxyz int;
select name from _db_serial;

alter table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t
      change column c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100cxyz
                    c_______10c_______20c_______30 int;
alter table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t
      change column c_______10c_______20c_______30
                    c_______10c_______20c_______30c_______40c_______50c_______60c_______70c_______80c_______90c______100cxyz int;
select name from _db_serial;

alter table t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t 
            owner to 	u_______10u_______20u_______30z;
select unique_name from _db_serial;

drop table u_______10u_______20u_______30z.t_______10t_______20t_______30t_______40t_______50t_______60t_______70t_______80t_______90t______100t______110t______120t;
select name from _db_serial;


-- Verify that multibyte characters are truncated by character, not by byte
create table 긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오테스트임(
             아주긴컬럼명시나리오아주긴컬럼명시나리오아주긴컬럼명시나리오아주긴컬럼명시나리오아주긴컬럼명시나리오아주긴컬럼명시나리오아주긴컬럼명시나리오아주긴컬럼명시나리오테스트임 int auto_increment);
select name from _db_serial;

rename table 긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오테스트임
           as t긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오테스트;
select name from _db_serial;

rename table t긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오테스트
           as tb긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오테스트;
select name from _db_serial;

rename table tb긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오테스트
           as tbl긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오테스트;
select name from _db_serial;

drop tbl긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오긴테이블이름시나리오테스트;
drop user u_______10u_______20u_______30z;

