===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
to_timestamp(f)    
2000-02-01 01:00:00.0     
2000-02-02 01:01:00.0     
2000-02-03 01:02:00.0     
2000-02-04 01:03:00.0     
2000-02-05 01:04:00.0     

===================================================
to_timestamp(f)    
2000-02-01 01:00:00.0     
2000-02-02 01:01:00.0     
2000-02-03 01:02:00.0     
2000-02-04 01:03:00.0     
2000-02-05 01:04:00.0     

===================================================
to_timestamp(f)    
2000-02-05 01:04:00.0     
2000-02-04 01:03:00.0     
2000-02-03 01:02:00.0     
2000-02-02 01:01:00.0     
2000-02-01 01:00:00.0     

===================================================
0
===================================================
0
