===================================================
0
===================================================
1
===================================================
ceil(s1)    
21.0     

===================================================
ceil(sn1)    
3.0     

===================================================
0
===================================================
1
===================================================
Error:-181
===================================================
Error:-181
===================================================
0
===================================================
( ceil('123'))    
123.0     

===================================================
( ceil(N'123'))    
123.0     

===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-181
===================================================
0
ceil( ?:0 )    
2001.0000000000000000     

===================================================
0
ceil( ?:0 )    
21.0000000000000000     

===================================================
0
ceil( ?:0 )    
2002.0000000000000000     

===================================================
Error:-181
