===================================================
0
===================================================
0
===================================================
1
===================================================
Error:-494
===================================================
0
===================================================
ceil(date '2001-10-10')    
null     

===================================================
0
===================================================
ceil( ?:0 )    
null     

===================================================
0
0
