===================================================
0
===================================================
0
===================================================
1
===================================================
ceil(s1)    
21.0     

===================================================
ceil(sn1)    
3.0     

===================================================
0
===================================================
1
===================================================
ceil(s1)    
null     

===================================================
ceil(sn1)    
null     

===================================================
0
===================================================
( ceil('123'))    
123.0     

===================================================
( ceil(N'123'))    
123.0     

===================================================
( ceil('asd'))    
null     

===================================================
( ceil(N'asd'))    
null     

===================================================
0
ceil( ?:0 )    
null     

===================================================
0
ceil( ?:0 )    
2001.0     

===================================================
0
ceil( ?:0 )    
21.0     

===================================================
0
ceil( ?:0 )    
2002.0     

===================================================
0
ceil( ?:0 )    
null     

===================================================
0
===================================================
0
