===================================================
    
null     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
0
===================================================
0
===================================================
0
===================================================
    
null     

===================================================
a    b    
1     1     
2     2     

===================================================
serial_next_value(dba.ser1, 1)    
1     

===================================================
1
===================================================
a    b    
1     1     
2     2     
110     10     

===================================================
a    b    
110     10     
2     2     
1     1     

===================================================
a    
110     
2     
1     

===================================================
a    
1     
2     
110     

===================================================
    
null     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
0
