===================================================
0
===================================================
0
===================================================
1
===================================================
abs(s1)    
20.0123     

===================================================
abs(sn1)    
3.0     

===================================================
0
===================================================
1
===================================================
abs(s1)    
null     

===================================================
abs(sn1)    
null     

===================================================
0
===================================================
( abs('123'))    
123.0     

===================================================
( abs(N'123'))    
123.0     

===================================================
( abs('asd'))    
null     

===================================================
( abs(N'asd'))    
null     

===================================================
0
abs( ?:0 )    
null     

===================================================
0
abs( ?:0 )    
2001.0000000000000000     

===================================================
0
abs( ?:0 )    
20.0109999999999992     

===================================================
0
abs( ?:0 )    
2001.1199999999998909     

===================================================
0
abs( ?:0 )    
null     

===================================================
0
===================================================
0
