===================================================
0
===================================================
0
===================================================
1
===================================================
floor(s1)    
20.0     

===================================================
floor(sn1)    
3.0     

===================================================
0
===================================================
1
===================================================
floor(s1)    
null     

===================================================
floor(sn1)    
null     

===================================================
0
===================================================
( floor('123'))    
123.0     

===================================================
( floor(N'123'))    
123.0     

===================================================
( floor('asd'))    
null     

===================================================
( floor(N'asd'))    
null     

===================================================
0
floor( ?:0 )    
null     

===================================================
0
floor( ?:0 )    
2001.0000000000000000     

===================================================
0
floor( ?:0 )    
20.0000000000000000     

===================================================
0
floor( ?:0 )    
2001.0000000000000000     

===================================================
0
floor( ?:0 )    
null     

===================================================
0
===================================================
0
