===================================================
0
===================================================
1
===================================================
1
===================================================
Error:-181
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
0
===================================================
Error:-181
===================================================
0
===================================================
s1    s2    mod( ?:0 , s2)    
2001-10-11     2              0.0000000000000000     
4     0              2.0000000000000000     
4     2              0.0000000000000000     

===================================================
0
===================================================
s1    s2    mod( ?:0 , s2)    
2001-10-11     2              null     
4     0              null     
4     2              null     

===================================================
0
===================================================
0
===================================================
Error:-181
===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
0.0000000000000000     

===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
4.0000000000000000     

===================================================
0
===================================================
Error:-181
===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
null     

===================================================
0
===================================================
mod( ?:0 ,  ?:1 )    
null     

===================================================
0
===================================================
mod('4',  ?:0 )    
0.0000000000000000     

===================================================
0
===================================================
mod('4',  ?:0 )    
0.0000000000000000     

